In [ ]:
import pandas as pd

data = pd.read_csv('student_results.csv')

print(data)

In [21]:
#Getting Average number for term 1
StudentAvg1 = (data['term 1']).mean() 
print("Average marks in Term 1 = ",StudentAvg1)

Average marks in Term 1 =  76.5

In [23]:
#Getting Average number for term 2
StudentAvg2 = (data['term 2']).mean() 
print("Average marks in Term 2 = ",StudentAvg2)

Average marks in Term 2 =  78.4

In [24]:
#Getting Average number for term 3
StudentAvg3 = (data['term 3']).mean() 
print("Average marks in Term 3 = ",StudentAvg3)

Average marks in Term 3 =  78.3

In [17]:
#showing the frst 5 students data, removing any duplicate id
data.drop_duplicates(subset=['id'], keep = 'first')

   id    name  phone sex and age test number  term 1  term 2  term 3
0   1    Mike    134        m_12      test 1      76      84      87
1   2   Linda    270        f_13      test 1      88      90      73
2   3     Sam    210        m_11      test 1      78      74      80
3   4  Esther    617        f_12      test 1      68      75      74
4   5    Mary    114        f_14      test 1      65      67      64

In [18]:
#showing the last 5 students data, removing any duplicate id
data.drop_duplicates(subset=['id'], keep = 'last')

   id    name  phone sex and age test number  term 1  term 2  term 3
5   1    Mike    134        m_12      test 2      85      80      90
6   2   Linda    270        f_13      test 2      87      82      94
7   3     Sam    210        m_11      test 2      80      87      80
8   4  Esther    617        f_12      test 2      70      75      78
9   5    Mary    114        f_14      test 2      68      70      63

In [26]:
#Getting Highest Grade for term 1
HighestGrade = (data['term 1']).max() 
print("Highest Grade in Term 1 = ",HighestGrade)

Highest Grade in Term 1 =  88

In [28]:
#Getting Lowest Grade for term 1
LowestGrade = (data['term 1']).min() 
print("Lowest Grade in Term 1 = ",LowestGrade)

Lowest Grade in Term 1 =  65